benchmarks/benchmark_cpu_tests/benchmark_results_epoll_100KB/epoll_c500_100kb.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /test_data/100kb.txt
Document Length:        102400 bytes

Concurrency Level:      500
Time taken for tests:   1.837 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      204924000 bytes
HTML transferred:       204800000 bytes
Requests per second:    1088.66 [#/sec] (mean)
Time per request:       459.279 [ms] (mean)
Time per request:       0.919 [ms] (mean, across all concurrent requests)
Transfer rate:          108932.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.4      0       4
Processing:     7  437  48.9    459     466
Waiting:        1  437  48.9    459     466
Total:          7  438  47.6    459     466

Percentage of the requests served within a certain time (ms)
  50%    459
  66%    461
  75%    464
  80%    464
  90%    466
  95%    466
  98%    466
  99%    466
 100%    466 (longest request)